results/linux/compute_low.txt
Running 1m test @ http://localhost:3000/compute
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.785ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.774ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.775ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.766ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   790.17us  400.37us   7.71ms   65.76%
    Req/Sec   534.70    113.59     0.89k    57.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  785.00us
 75.000%    1.07ms
 90.000%    1.30ms
 99.000%    1.74ms
 99.900%    2.07ms
 99.990%    3.94ms
 99.999%    6.93ms
100.000%    7.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.032     0.000000            5         1.00
       0.263     0.100000        10029         1.11
       0.409     0.200000        20001         1.25
       0.542     0.300000        30046         1.43
       0.663     0.400000        39984         1.67
       0.785     0.500000        49965         2.00
       0.844     0.550000        55019         2.22
       0.901     0.600000        59960         2.50
       0.955     0.650000        64925         2.86
       1.012     0.700000        69931         3.33
       1.071     0.750000        74933         4.00
       1.100     0.775000        77422         4.44
       1.131     0.800000        79943         5.00
       1.166     0.825000        82435         5.71
       1.205     0.850000        84959         6.67
       1.249     0.875000        87431         8.00
       1.275     0.887500        88671         8.89
       1.303     0.900000        89895        10.00
       1.335     0.912500        91151        11.43
       1.372     0.925000        92425        13.33
       1.413     0.937500        93646        16.00
       1.435     0.943750        94263        17.78
       1.462     0.950000        94890        20.00
       1.492     0.956250        95513        22.86
       1.526     0.962500        96149        26.67
       1.560     0.968750        96761        32.00
       1.579     0.971875        97074        35.56
       1.599     0.975000        97380        40.00
       1.621     0.978125        97712        45.71
       1.647     0.981250        98016        53.33
       1.676     0.984375        98325        64.00
       1.694     0.985938        98479        71.11
       1.711     0.987500        98628        80.00
       1.733     0.989062        98789        91.43
       1.752     0.990625        98950       106.67
       1.778     0.992188        99098       128.00
       1.794     0.992969        99175       142.22
       1.811     0.993750        99256       160.00
       1.831     0.994531        99330       182.86
       1.854     0.995313        99410       213.33
       1.878     0.996094        99486       256.00
       1.893     0.996484        99525       284.44
       1.908     0.996875        99566       320.00
       1.923     0.997266        99603       365.71
       1.934     0.997656        99643       426.67
       1.956     0.998047        99681       512.00
       1.966     0.998242        99701       568.89
       1.982     0.998437        99722       640.00
       2.000     0.998633        99740       731.43
       2.026     0.998828        99760       853.33
       2.071     0.999023        99779      1024.00
       2.095     0.999121        99791      1137.78
       2.119     0.999219        99798      1280.00
       2.203     0.999316        99808      1462.86
       2.285     0.999414        99818      1706.67
       2.579     0.999512        99828      2048.00
       2.797     0.999561        99833      2275.56
       2.873     0.999609        99837      2560.00
       3.051     0.999658        99842      2925.71
       3.201     0.999707        99847      3413.33
       3.289     0.999756        99852      4096.00
       3.343     0.999780        99856      4551.11
       3.353     0.999805        99857      5120.00
       3.541     0.999829        99859      5851.43
       3.735     0.999854        99862      6826.67
       3.883     0.999878        99864      8192.00
       3.937     0.999890        99866      9102.22
       3.959     0.999902        99867     10240.00
       3.999     0.999915        99868     11702.86
       4.099     0.999927        99869     13653.33
       4.103     0.999939        99870     16384.00
       4.115     0.999945        99871     18204.44
       4.147     0.999951        99872     20480.00
       4.147     0.999957        99872     23405.71
       4.295     0.999963        99873     27306.67
       4.295     0.999969        99873     32768.00
       5.915     0.999973        99874     36408.89
       5.915     0.999976        99874     40960.00
       5.915     0.999979        99874     46811.43
       6.931     0.999982        99875     54613.33
       6.931     0.999985        99875     65536.00
       6.931     0.999986        99875     72817.78
       6.931     0.999988        99875     81920.00
       6.931     0.999989        99875     93622.86
       7.715     0.999991        99876    109226.67
       7.715     1.000000        99876          inf
#[Mean    =        0.790, StdDeviation   =        0.400]
#[Max     =        7.712, Total count    =        99876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119969 requests in 1.00m, 14.64MB read
Requests/sec:   1999.43
Transfer/sec:    249.93KB