results/linux/compute_mid.txt
Running 1m test @ http://localhost:3000/compute
  8 threads and 200 connections
  Thread calibration: mean lat.: 0.880ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.844ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.856ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.830ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.856ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.873ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.885ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.872ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   808.57us  438.62us   8.74ms   67.79%
    Req/Sec   655.52    100.21     1.22k    76.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.86ms
 75.000%    1.09ms
 90.000%    1.30ms
 99.000%    1.84ms
 99.900%    2.99ms
 99.990%    6.72ms
 99.999%    7.81ms
100.000%    8.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.028     0.000000            1         1.00
       0.181     0.100000        24983         1.11
       0.358     0.200000        49899         1.25
       0.574     0.300000        74938         1.43
       0.733     0.400000        99905         1.67
       0.861     0.500000       124877         2.00
       0.917     0.550000       137343         2.22
       0.966     0.600000       149875         2.50
       1.009     0.650000       162170         2.86
       1.049     0.700000       174691         3.33
       1.088     0.750000       187255         4.00
       1.107     0.775000       193497         4.44
       1.127     0.800000       199719         5.00
       1.149     0.825000       205800         5.71
       1.180     0.850000       212050         6.67
       1.228     0.875000       218210         8.00
       1.262     0.887500       221322         8.89
       1.302     0.900000       224433        10.00
       1.348     0.912500       227566        11.43
       1.399     0.925000       230673        13.33
       1.455     0.937500       233817        16.00
       1.484     0.943750       235352        17.78
       1.517     0.950000       236922        20.00
       1.554     0.956250       238474        22.86
       1.593     0.962500       240027        26.67
       1.632     0.968750       241584        32.00
       1.655     0.971875       242388        35.56
       1.678     0.975000       243158        40.00
       1.702     0.978125       243919        45.71
       1.730     0.981250       244717        53.33
       1.763     0.984375       245492        64.00
       1.780     0.985938       245882        71.11
       1.799     0.987500       246256        80.00
       1.822     0.989062       246647        91.43
       1.844     0.990625       247041       106.67
       1.870     0.992188       247420       128.00
       1.885     0.992969       247621       142.22
       1.902     0.993750       247816       160.00
       1.919     0.994531       248006       182.86
       1.938     0.995313       248207       213.33
       1.957     0.996094       248397       256.00
       1.970     0.996484       248495       284.44
       1.987     0.996875       248593       320.00
       2.003     0.997266       248689       365.71
       2.021     0.997656       248784       426.67
       2.045     0.998047       248881       512.00
       2.069     0.998242       248937       568.89
       2.101     0.998437       248981       640.00
       2.255     0.998633       249028       731.43
       2.663     0.998828       249076       853.33
       3.021     0.999023       249126      1024.00
       3.103     0.999121       249149      1137.78
       3.209     0.999219       249174      1280.00
       3.335     0.999316       249198      1462.86
       3.463     0.999414       249222      1706.67
       3.659     0.999512       249247      2048.00
       3.727     0.999561       249259      2275.56
       3.897     0.999609       249272      2560.00
       3.993     0.999658       249283      2925.71
       4.143     0.999707       249295      3413.33
       4.295     0.999756       249308      4096.00
       4.359     0.999780       249314      4551.11
       4.471     0.999805       249320      5120.00
       4.699     0.999829       249326      5851.43
       6.163     0.999854       249332      6826.67
       6.487     0.999878       249338      8192.00
       6.687     0.999890       249341      9102.22
       6.843     0.999902       249344     10240.00
       7.071     0.999915       249347     11702.86
       7.239     0.999927       249350     13653.33
       7.411     0.999939       249353     16384.00
       7.471     0.999945       249355     18204.44
       7.523     0.999951       249356     20480.00
       7.607     0.999957       249358     23405.71
       7.627     0.999963       249359     27306.67
       7.711     0.999969       249361     32768.00
       7.719     0.999973       249362     36408.89
       7.719     0.999976       249362     40960.00
       7.723     0.999979       249363     46811.43
       7.759     0.999982       249365     54613.33
       7.759     0.999985       249365     65536.00
       7.759     0.999986       249365     72817.78
       7.759     0.999988       249365     81920.00
       7.811     0.999989       249366     93622.86
       7.811     0.999991       249366    109226.67
       7.987     0.999992       249367    131072.00
       7.987     0.999993       249367    145635.56
       7.987     0.999994       249367    163840.00
       7.987     0.999995       249367    187245.71
       7.987     0.999995       249367    218453.33
       8.743     0.999996       249368    262144.00
       8.743     1.000000       249368          inf
#[Mean    =        0.809, StdDeviation   =        0.439]
#[Max     =        8.736, Total count    =       249368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299796 requests in 1.00m, 36.60MB read
Requests/sec:   4996.45
Transfer/sec:    624.56KB